app/views/aces/soap/atp_requests/wsdl.wsdl.erb

<?xml version='1.0' encoding='UTF-8'?>
<wsdl:definitions xmlns="" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:ext="http://at.dsh.cms.gov/exchange/1.0" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" targetNamespace="http://at.dsh.cms.gov/exchange/1.0">
  <wsdl:types>
    <xsd:schema xmlns:exch="http://at.dsh.cms.gov/exchange/1.0" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" targetNamespace="http://at.dsh.cms.gov/exchange/1.0">
      <xsd:include schemaLocation="../../atp_service.xsd"/>
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="TransferRequest">
    <wsdl:part element="ext:AccountTransferRequest" name="body"/>
  </wsdl:message>
  <wsdl:message name="TransferResponse">
    <wsdl:part element="ext:AccountTransferResponse" name="body"/>
  </wsdl:message>
  <wsdl:portType name="AccountTransferPortType">
    <wsdl:operation name="transferAccount">
      <wsdl:input message="ext:TransferRequest"/>
      <wsdl:output message="ext:TransferResponse"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="AccountTransferSoapBinding" type="ext:AccountTransferPortType">
    <soap12:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="transferAccount">
      <soap12:operation/>
      <wsdl:input>
        <soap12:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap12:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="AccountTransferService">
    <wsdl:documentation>Account Transfer Service</wsdl:documentation>
    <wsdl:port binding="ext:AccountTransferSoapBinding" name="AccountTransferPort">
      <soap12:address location="<%= request.original_url.split("/")[0..-2].join("/") %>/service"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>